README.md updated for production grade
